<div class="row">
    <div class="col s12">
        <p>O Tenda Form &eacute; ideal para qualquer tipo de consulta ao&nbsp;p&uacute;blico. Nesta p&aacute;gina vamos te orientar a montar uma estrutura igual a usada no museu itinerante&nbsp;<a href="http://cienciassobtendas.uff.br" target="_blank">Ci&ecirc;ncias sob Tendas</a>. N&atilde;o que este seja o &uacute;nico caso de uso, &eacute; apenas um ponto de partida.</p>
        <h4>Infraestrutura</h4>
        <p>No&nbsp;<a href="http://cienciassobtendas.uff.br" target="_blank">Ci&ecirc;ncias sob Tendas</a>&nbsp;queria-mos oferecer ao usu&aacute;rio um brinde por responder a pesquisa, que no caso era uma "selfie" sobre uma moldura estilizada para o projeto. Essa funcionalidade est&aacute; presente no c&oacute;digo, por&eacute;m, sua configura&ccedil;&atilde;o ser&aacute; melhor detalhada em outro artigo. No entanto, para usar de tal recurso, contava-mos em nossa infraestrutura com uma impressora para imprimir as imagens.</p>
        <p>A configura&ccedil;&atilde;o da impressora &eacute; feita diretamente no computador servidor, n&atilde;o h&aacute; configura&ccedil;&atilde;o de impressora no Tenda Form. O servidor &eacute; o &uacute;nico dispositivo no qual o programa precisa estar instalado, pois &eacute; nele que ir&atilde;o se concentrar todos os servi&ccedil;os necess&aacute;rios para o funcionamento do Tenda Form. &nbsp;Como servidor, usamos um netbook asus rodando sistema operacional Ubuntu 14.04. Os servi&ccedil;os instalados para o funcionamento correto do programa s&atilde;o:</p>
        <ul>
            <li>MongoDB</li>
            <li>Apache2</li>
            <li>PHP5</li>
        </ul>
        <p>O processo de instala&ccedil;&atilde;o desses servi&ccedil;os ser&atilde;o melhor detalhados adiante.</p>
        <p>Como v&aacute;rias pessoas poderiam ter interesse em responder a pesquisa, disponibilizamos dois tablets android como pontos de&nbsp;resposta. Um navcity e um galaxy tab 2. Nesse caso, como &eacute; mais de um ponto de resposta espalhado no ambiente, foi necess&aacute;rio o uso de um roteador wireless para criar uma rede local. Nessa rede, &eacute; importante que o computador servidor esteja com um IP fixo alocado. Pois dessa forma a configura&ccedil;&atilde;o e manuten&ccedil;&atilde;o dos pontos de resposta, neste caso s&atilde;o os tablets, fica muito mais f&aacute;cil.</p>
        <h4>Instala&ccedil;&atilde;o do Tenda Form</h4>
        <p>No ubuntu, o processo de instala&ccedil;&atilde;o do Tenda Form &eacute; feito pela interface de comando de texto. N&atilde;o &eacute; nada dificil, explicarei tudo direitinho, e ser&aacute; at&eacute; divertido! Primeiramente abra o Unity Shell, clicando no bot&atilde;o ubuntu no canto superior esquerdo, ou com o "bot&atilde;o do windows" do seu teclado. No Unity Shell procure pelo programa "Terminal".</p>
        <p>No terminal, instala os servi&ccedil;os necess&aacute;rios para o funcionamento do Tenda Form. Para agilizar, &eacute; o comando abaixo:</p>
        <p><code>sudo apt-get install php5 apache2 mongodb libapache2-mod-php5 php5-mongo git</code></p>
        <p>Ap&oacute;s todos os servi&ccedil;os instalados, &eacute; hora de instalar o&nbsp;<a href="https://getcomposer.org/" target="_blank">Composer</a>. Basta usar o seguinte comando:</p>
        <p><code>curl -sS https://getcomposer.org/installer | sudo php -- --install-dir=/usr/local/bin -- --filename=composer</code></p>
        <p>Nosso terceiro passo agora &eacute; baixar o c&oacute;digo do Tenda Form. O comando para isso &eacute;:</p>
        <p><code>git clone <a href="https://github.com/vsodre/tenda-form">https://github.com/vsodre/tenda-form</a></code></p>
        <p>Por fim, instalamos o programa:</p>
        <p><code>composer install -d tenda-form/</code></p>
    </div>
</div>
